import React from "react";

function Provicy(props) {
  return (
    <div>
      <div className="min-h-screen py-20 px-20">
        <div className="max-w-5xl mx-auto bg-[#1e1f1e] rounded-lg shadow-lg">
          <div className="p-8">
            <h2 className="text-gray-300 text-2xl font-bold mb-6">
              Политика конфиденциальности
            </h2>
            <p className="text-gray-400 text-lg">Сбор персональной информации</p>
            <p className="text-gray-400 mb-6">
              Мы можем собирать следующую персональную информацию от вас:
            </p>
            <ul className="list-disc pl-6 mb-6">
              <li className="text-gray-400">
                Имя, контактная информация и другие релевантные данные для
                обработки регистрации волонтеров, связи с вами относительно
                вопросов или обращений.
              </li>
              <li className="text-gray-400">
                Информацию, которую вы предоставляете при участии в активностях,
                мероприятиях или кампаниях, связанных с инициативами по очистке
                города и благополучию животных.
              </li>
            </ul>
            <p className="text-gray-400 text-lg">Использование персональной информации</p>
            <p className="text-gray-400 mb-6">
              Мы используем собранную персональную информацию в следующих целях:
            </p>
            <ul className="list-disc pl-6 mb-6">
              <li className="text-gray-400">
                Обработка регистрации волонтеров, координация активностей и
                связь с вами относительно возможностей для волонтерства.
              </li>
              <li className="text-gray-400">
                Предоставление информации о мероприятиях по очистке города,
                экологических кампаниях и программах по защите животных, если вы
                дали согласие на получение такой информации.
              </li>
              <li className="text-gray-400">
                Анализ предпочтений и интересов для улучшения содержания нашего
                веб-сайта и предоставления персонализированных рекомендаций по
                волонтерской деятельности.
              </li>
              <li className="text-gray-400">
                Обеспечение поддержки клиентов, включая ответы на вопросы и
                обращения.
              </li>
              <li className="text-gray-400">
                Проведение статистического анализа и сбор информации для
                улучшения наших программ и инициатив.
              </li>
            </ul>
            <p className="text-gray-400 text-lg">Раскрытие персональной информации</p>
            <p className="text-gray-400 mb-6">
              Мы не продаем, не передаем и не раскрываем вашу персональную
              информацию третьим лицам без вашего согласия, за исключением
              следующих случаев:
            </p>
            <ul className="list-disc pl-6 mb-6">
              <li className="text-gray-400">
                Предоставление информации соответствующим организациям или
                учреждениям для облегчения волонтерских активностей, координации
                мероприятий или поддержки программ по защите животных.
              </li>
              <li className="text-gray-400">
                Соблюдение применимых законов и правил, включая сотрудничество с
                правоохранительными органами в рамках расследования преступлений
                или предотвращения мошенничества.
              </li>
              <li className="text-gray-400">
                Защита наших прав и интересов, включая принятие мер по
                предотвращению потенциальных нарушений и обеспечению
                безопасности нашего веб-сайта и пользователей.
              </li>
            </ul>
            <p className="text-gray-400 text-lg">Защита персональной информации</p>
            <p className="text-gray-400 mb-6">
              Мы применяем меры безопасности для защиты вашей персональной
              информации от несанкционированного доступа, использования или
              раскрытия. Мы применяем технические, физические и административные
              меры безопасности для обеспечения конфиденциальности и целостности
              ваших данных.
            </p>
            <p className="text-gray-400 text-lg">Хранение персональной информации</p>
            <p className="text-gray-400 mb-6">
              Мы храним вашу персональную информацию только в течение периода,
              необходимого для достижения целей, описанных в настоящей политике
              конфиденциальности, или в соответствии с требованиями закона.
              После истечения этого срока мы удаляем или анонимизируем вашу
              информацию.
            </p>
            <p className="text-gray-400 text-lg">Ваши права</p>
            <p className="text-gray-400 mb-6">
              У вас есть определенные права в отношении вашей персональной
              информации, включая:
            </p>
            <ul className="list-disc pl-6 mb-6">
              <li className="text-gray-400">
                Право на доступ и запрос на исправление, обновление или удаление
                вашей персональной информации.
              </li>
              <li className="text-gray-400">
                Право на ограничение обработки ваших персональных данных или
                возражение против определенных видов обработки.
              </li>
              <li className="text-gray-400">
                Право отозвать ваше согласие на обработку данных, если вы ранее
                дали такое согласие.
              </li>
              <li className="text-gray-400">
                Право на передачу вашей персональной информации в
                машинно-читаемом формате или на передачу ее другой ответственной
                стороне.
              </li>
            </ul>
            <p className="text-gray-400 mb-6">
              Вы можете связаться с нами, чтобы осуществить свои права или
              задать вопросы относительно нашей политики конфиденциальности.
            </p>
            <p className="text-gray-400 text-lg">Изменения в политике конфиденциальности</p>
            <p className="text-gray-400 mb-6">
              Мы можем время от времени обновлять нашу политику
              конфиденциальности. Любые изменения будут опубликованы на нашем
              веб-сайте, и мы рекомендуем вам периодически проверять политику
              для ознакомления с обновлениями.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Provicy;
